Autodesk.Revit.DB.ComponentRepeaterSlot.MakeDefault
Populates the slot with an instance of the default family type of the component repeater.
Since:
2014

Autodesk.Revit.DB.ComponentRepeaterSlot.MakeEmpty
Makes the slot empty by removing the instance currently held by the slot.
Since:
2014

Autodesk.Revit.DB.ComponentRepeaterSlot.IsTypeValidForSlot(Autodesk.Revit.DB.ElementId)
Determines whether instance of given family type can be used in the component repeater slot.
typeId:
The element id of the type.
Returns:
True if the family type can be used in the component repeater slot.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.ComponentRepeaterSlot.FamilyType
The id of the family type of the component in the slot, or invalid id if the slot is empty.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: Invalid type for the slot. The type must be an adaptive family with no shape handles.
In addition, it must have same category and same number of placement points as the current type of the repeater.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.ComponentRepeaterSlot.IsDefault
A flag indicating whether the slot currently holds an instance of the default family type of the component repeater.
Since:
2014

Autodesk.Revit.DB.ComponentRepeaterSlot.IsEmpty
A flag indicating whether the slot is currently empty.
Since:
2014

Autodesk.Revit.DB.ComponentRepeaterSlot
Represents a slot that holds one repeated component in a component repeater.
Remarks:
Each slot can be in one of the following states:
Empty.  Occupied by an instance of the default family of the repeater that contains the slot.  Occupied by an instance of another family.
Initially, every occupied slot holds an instance of the default family of the repeater, based on the original
element that was repeated.
Since:
2014